docs/resumen-k6-search.txt
default   [  99% ] 03/30 VUs  1m19.0s/1m20.0s

running (1m20.0s), 01/30 VUs, 1645 complete and 0 interrupted iterations
default   [ 100% ] 01/30 VUs  1m20.0s/1m20.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<3000' p(95)=125.79ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 4938    61.134406/s
    checks_succeeded...: 100.00% 4938 out of 4938
    checks_failed......: 0.00%   0 out of 4938

    ✓ status 200
    ✓ responde en < 3s
    ✓ respuesta es array

    CUSTOM
    errors.........................: 0.00%  0 out of 1646
    search_duration................: avg=103.81ms min=86.38ms med=100.53ms max=590.16ms p(90)=114.96ms p(95)=125.79ms

    HTTP
    http_req_duration..............: avg=103.81ms min=86.38ms med=100.53ms max=590.16ms p(90)=114.96ms p(95)=125.79ms
      { expected_response:true }...: avg=103.81ms min=86.38ms med=100.53ms max=590.16ms p(90)=114.96ms p(95)=125.79ms
    http_req_failed................: 0.00%  0 out of 1646
    http_reqs......................: 1646   20.378135/s

    EXECUTION
    iteration_duration.............: avg=1.1s     min=1.08s   med=1.1s     max=1.83s    p(90)=1.11s    p(95)=1.13s   
    iterations.....................: 1646   20.378135/s
    vus............................: 1      min=1         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 859 kB 11 kB/s
    data_sent......................: 240 kB 3.0 kB/s



running (1m20.8s), 00/30 VUs, 1646 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  1m20s